/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   typedef.cpp                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/20 22:14:29 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/20 22:14:31 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;
typedef int i;
/**
 * typedef란?
 * 타입의 별칭을 정의한다.
 * 실제 타입 이름대신 별칭으로 사용할 수 있는 것을 말한다.
 * 이를 통해 C++에서 이미 정의된 타입 또는 사용자가 정의한 타입(struct 또는 Class)보다 더 짧거나 의미있는 이름을 지을 수 있습니다.
*/

int main() {
	i a = 1;
	cout << a << '\n';
	return 0;
}
