/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   bool.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 15:21:12 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 15:26:55 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	/**
	 * bool
	 * 1바이트, true OR false. 1 또는 0으로 해도 무방합니다.
	 * 참고로 C++에서는 0이면 false, 0이 아닌 값들은 모두 true가 되며 bool() 통해 간단하게 bool형으로 형변환이 가능합니다.
	*/

	int a = -1;
	cout << bool(a) << "\n";
	a = 0;
	cout << bool(a) << "\n";
	a = 3;
	cout << bool(a) << "\n";
	
	return 0;
}