/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cin.cpp                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 09:56:31 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 10:05:27 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	string a, b;
	/**
	 * 문제에서 형식을 기반으로 입력이 주어지지 않은 경우 scanf()보다는 cin을 쓰는 것이 좋다.
	 * cin은 개행 문자까지 입력받습니다.
	 * 
	 * ex) choi dong을 입력하는 경우 a 변수에 choi까지만 할당한다.
	*/
	cin >> a >> b;
	cout << a << "\t" << b << "\n";

	return 0;
}
