/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   double.cpp                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 11:47:01 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 15:51:15 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

double a() {
	return 1.2222;
}

int main() {
	/**
	 * double
	 * 실수를 저장할 수 있는 자료형이다.
	 * 8 바이트이며, 소수점 아래로 15자리까지 표현이 가능하다.
	 * 
	 * 웬만하면 float보다는 double을 사용하도록 합니다.
	*/
	double ret = a();
	double pi = 3.221;
	cout << ret << "\n";
	cout << pi << "\n";

	return 0;
}
