/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   base.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/30 17:10:22 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/30 17:30:12 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	/**
	 * n진법 변환
	 * 10 <=> 2 <=> 16 <=> 8
	 * 
	 * 10진수에서 2진수로 바꾸는 방법은 소인수분해로 나머지를 구하면 됨.
	 * EX) 53 <=> 110101 <=> 35 <=> 65
	*/
	vector<int> v;

	// 53; 10진수
	// 0b110101; 2진수
	// 065; 8진수
	// 0x35; 16진수
	int num = 0b110101; // 진수변환할 숫자
	int base = 16; // 변환할 진수

	while (num > 1) {
		cout << num << "\n";
		v.push_back(num % base);
		num /= base;
	}
	if (num == 1) v.push_back(1);
	// 배열에 반대로 저장되어서 바꿔줌
	reverse(v.begin(), v.end());

	for (int a : v) {
		// 16진수로 변환하는 과정을 위해 필요함.
		if (a >= 10) char(a + 55);
		else cout << a;
	}
	cout << "\n";

	return 0;
}