/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   data_structure.cpp                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/23 17:03:59 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/23 17:06:10 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	/**
	 * 자료구조(컨테이너)
	 * 데이터들과의 관계, 함수, 명령등의 집합을 의미
	 * 데이터의 접근, 수정등 데이터의 처리를 효율적으로 할 수 있게 만든 구조
	 * 
	 * 선형구조
	 * 배열, 스택, 큐, 연결리스트
	 * 
	 * 비선형구조
	 * 그래프, 트리
	*/
	return 0;
}