/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   auto.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 16:20:22 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 16:42:27 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	/**
	 * auto
	 * 타입 추론을 통해 결정되는 타입.
	 * 복잡하고 긴 타입의 변수명을 대신하는 간단한 방법이다.
	*/

	auto i = 1;
	cout << i << "\n";
	
	return 0;
}
