/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   long long.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 15:46:33 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 15:49:23 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

int main() {
	/**
	 * long long
	 * 8바이트짜라 정수입니다.
	 * 범위는 –9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807입니다.
	 * 
	 * 최대값의 경우 int와 마찬가지로 따로 정해놓으나, 문제마다 다르니 참고만 해야 함.
	*/
	typedef long long ll;
	ll INF = 1e18;

	return 0;
}