/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   void.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: donchoi <donchoi@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/21 11:42:01 by donchoi           #+#    #+#             */
/*   Updated: 2022/12/21 11:48:58 by donchoi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include<bits/stdc++.h>
using namespace std;

void a() {
	int ret = 1;
	ret = 2;
	cout << ret << "\n";
}

int main() {
	/**
	 * void
	 * 리턴하는 값이 없다. 라는 자료형이다.
	*/
	a();

	return 0;
}
